Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/DataProcessors/ГрупповоеПерепроведениеДокументов/ГрупповоеПерепроведениеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e6643852-2b29-4280-8c85-43901fdbd7d9">
  <name>ГрупповоеПерепроведениеДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/InformationRegisters/ГП_ПараметрыРегламентныхЗаданий/ГП_ПараметрыРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГП_ПараметрыРегламентныхЗаданий</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВыбранныеТипыСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Организации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/Enums/ГП_ПараметрыРегламентныхЗаданий/ГП_ПараметрыРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГП_ПараметрыРегламентныхЗаданий</name>
  <enumValues>
    <name>ТипыДокументов</name>
  </enumValues>
  <enumValues>
    <name>Организации</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачала</name>
  </enumValues>
  <enumValues>
    <name>ТекущийДокумент</name>
  </enumValues>
  <enumValues>
    <name>КоличествоМесяцевДляПерепроведения</name>
  </enumValues>
  <enumValues>
    <name>ПолучателиРассылки</name>
  </enumValues>
</mdclass:Enum>

Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/DataProcessors/ГрупповоеПерепроведениеДокументов/Forms/Форма/Module.bsl
# Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// Добавляем команду "Выполнить с параметрами"
	КомандаФильтр = Команды.Добавить("ГП_ВыполнитьСФильтром");
	КомандаФильтр.Заголовок = НСтр("ru = 'Выполнить с параметрами'");
	КомандаФильтр.Действие = "ГП_ВыполнитьСФильтром";
	
	// Добавляем команду "Настройка параметров"
	КомандаНастройка = Команды.Добавить("ГП_НастройкаПараметров");
	КомандаНастройка.Действие = "ГП_НастройкаПараметров";
	
	// Группа: кнопка + гиперссылка в одну строку
	ГП_ГруппаНастройки = Элементы.Добавить("ГП_ГруппаНастройки", Тип("ГруппаФормы"));
	ГП_ГруппаНастройки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	
	КнопкаНастройка = Элементы.Добавить("ГП_НастройкаПараметров", Тип("КнопкаФормы"), ГП_ГруппаНастройки);
	КнопкаНастройка.ИмяКоманды = "ГП_НастройкаПараметров";
	КнопкаНастройка.Вид = ВидКнопкиФормы.Гиперссылка;
	КнопкаНастройка.РастягиватьПоГоризонтали = Истина;
	КнопкаНастройка.Заголовок = ГП_ПостроитьЗаголовокНастройки();
	
	КнопкаФильтр = Элементы.Добавить("ГП_ВыполнитьСФильтром", Тип("КнопкаФормы"), ГП_ГруппаНастройки);
	КнопкаФильтр.ИмяКоманды = "ГП_ВыполнитьСФильтром";
	КнопкаФильтр.Картинка = БиблиотекаКартинок.СтрелкаВправо;
	КнопкаФильтр.Отображение = ОтображениеКнопки.КартинкаИТекст; 
	
КонецПроцедуры

&НаКлиенте
Процедура ГП_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_ГП_ПараметрыРегламентныхЗаданий" Тогда
		ГП_ОбновитьОписаниеНастройкиНаСервере();
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ГП_ВыполнитьСФильтром(Команда)
	
	Результат = ГП_ВыполнитьНаСервереСФильтром();
	ГП_ИнициализацияКомандДокументаНаКлиенте(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ГП_ИнициализацияКомандДокументаНаКлиенте(Результат)
	
	Если ОписаниеФоновогоЗадания <> Неопределено И Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОписаниеФоновогоЗадания.Статус = "Выполняется" Тогда
		ОписаниеПроцесса = ОписаниеПроцессаДлительнойОперации();
		ОписаниеПроцесса.ИспользоватьПерепроведениеДокументов = Истина;
		ОписаниеПроцесса.КоличествоОрганизаций = Результат.ВыбранныеОрганизации.Количество();
		Если Результат.ВыбранныеОрганизации.Количество() > 0 Тогда
			ОписаниеПроцесса.Организация = Результат.ВыбранныеОрганизации[0];
		КонецЕсли;
		ОписаниеПроцесса.Месяц = НачалоМесяца(Результат.ДатаНачалаПерепроведения);
		Если НачалоМесяца(Результат.ДатаНачалаПерепроведения) = НачалоМесяца(Результат.ДатаОкончанияПерепроведения) Тогда
			ОписаниеПроцесса.КоличествоМесяцев = 1;
		Иначе
			НачальныйМесяц = Месяц(Результат.ДатаНачалаПерепроведения);
			КонечныйМесяц = Месяц(Результат.ДатаОкончанияПерепроведения);
			НачальныйГод = Год(Результат.ДатаНачалаПерепроведения);
			КонечныйГод = Год(Результат.ДатаОкончанияПерепроведения);
			Если НачальныйМесяц > КонечныйМесяц Тогда
				ОписаниеПроцесса.КоличествоМесяцев = (КонечныйГод - НачальныйГод - 1) * 12 + (12 - НачальныйМесяц + КонечныйМесяц) + 1;
			Иначе
				ОписаниеПроцесса.КоличествоМесяцев = (КонечныйГод - НачальныйГод) * 12 + (КонечныйМесяц - НачальныйМесяц) + 1;
			КонецЕсли;
		КонецЕсли;
		ФормаДлительнойОперации = ОткрытьФормуДлительнойОперации(
			ЭтотОбъект, ОписаниеФоновогоЗадания.ИдентификаторЗадания, ОписаниеПроцесса);
		ФормаДлительнойОперации.ЗапуститьПериодическиеПроверкиПрогресса();
	Иначе
		ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
	КонецЕсли;
	
	ОповещениеОЗавершенииЗадания = Новый ОписаниеОповещения("ПоказатьРезультатПерепроведения", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессеВыполнения(ФормаДлительнойОперации);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ОписаниеФоновогоЗадания, ОповещениеОЗавершенииЗадания, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ГП_НастройкаПараметров(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ГП_НастройкаПараметровПослеЗакрытия", ЭтотОбъект);
	ОткрытьФорму(
		"Обработка.ГрупповоеПерепроведениеДокументов.Форма.Настройка",
		,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ГП_НастройкаПараметровПослеЗакрытия(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	ГП_ОбновитьОписаниеНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Функция ГП_ВыполнитьНаСервереСФильтром()

	Если ТолькоВыбранныеОрганизации = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации";
		Выборка = Запрос.Выполнить().Выбрать();
		ВыбранныеОрганизации = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ВыбранныеОрганизации.Добавить(Выборка.Организация);
		КонецЦикла;
	Иначе
		ВыбранныеОрганизации = Новый Массив;
		Для Каждого ЭлементСпискаОрганизаций Из ТаблицаОрганизаций Цикл
			Если ЗначениеЗаполнено(ЭлементСпискаОрганизаций.Организация) Тогда
				ВыбранныеОрганизации.Добавить(ЭлементСпискаОрганизаций.Организация);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 

	// Возможно, что фоновое задание было запущено раньше, 
	// пользователь дал команду его отменить, однако задание не отменено.
	// В таком случае не следует запускать задание повторно - следует дождаться его выполнения.
	// Мы можем отследить ситуацию, только если все это происходит в одной форме.
	Если ОписаниеФоновогоЗадания <> Неопределено Тогда

		Если ЗаданиеЕщеВыполняется(ОписаниеФоновогоЗадания.ИдентификаторЗадания) Тогда
			Возврат Неопределено; // надо ждать
		КонецЕсли;
		ОписаниеФоновогоЗадания = Неопределено;

	КонецЕсли;

	ВыбранныеТипыДокументов = РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.ПолучитьПараметр(
		Перечисления.ГП_ПараметрыРегламентныхЗаданий.ТипыДокументов, Новый Массив);

	СтруктураПараметров = Новый Структура("Организация, ДатаНачала, ДатаОкончания, ЗаписыватьОшибкиВЖурналРегистрации, ОстанавливатьсяПоОшибке, 
	|СообщатьПрогрессВыполнения, АдресХранилищаСОшибками, ДанныеЗаблокированы, ТолькоВыбранныеОрганизации, ВыбранныеТипы",
	ВыбранныеОрганизации,
	?(ЗначениеЗаполнено(Объект.ДатаНачала), Объект.ДатаНачала, Неопределено),
	?(ЗначениеЗаполнено(Объект.ДатаОкончания), Объект.ДатаОкончания, Неопределено),
	Истина,
	Объект.ОстанавливатьсяПоОшибке,
	Истина,
	"",
	Истина,
	?(ТолькоВыбранныеОрганизации = 0, Ложь, Истина),
	ВыбранныеТипыДокументов);

	// Временное хранилище для отчета об ошибках необходимо создавать
	// в том же сеансе работы с пользователем, из которого требуется обращение к ним, 
	// т.к. временное хранилище очищается при завершении сеанса фонового задания.
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.АдресХранилищаСОшибками) Тогда
		СтруктураПараметров.Вставить("АдресХранилищаСОшибками", ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор));
	КонецЕсли;

	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);

	КлючЗадания = "";	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Групповое перепроведение документов'");
	ПараметрыВыполнения.КлючФоновогоЗадания = КлючЗадания;
	// Если на файловой базе уже запущено любое другое фоновое задание, то новое встанет в очередь, а не будет запущено в основном потоке.
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	ОписаниеФоновогоЗадания = ДлительныеОперации.ВыполнитьПроцедуру(
	ПараметрыВыполнения,
	"Обработки.ГрупповоеПерепроведениеДокументов.ПерепроведениеДокументов",
	СтруктураПараметров,
	АдресХранилища);

	ИдентификаторЗадания = ОписаниеФоновогоЗадания.ИдентификаторЗадания;

	Результат = ОбщегоНазначения.СкопироватьРекурсивно(ОписаниеФоновогоЗадания);

	Результат.Вставить("ВыбранныеОрганизации",        ВыбранныеОрганизации);
	Результат.Вставить("ДатаНачалаПерепроведения",    Объект.ДатаНачала);
	Результат.Вставить("ДатаОкончанияПерепроведения", Объект.ДатаОкончания);

	Возврат Результат;

КонецФункции

&НаСервере
Процедура ГП_ОбновитьОписаниеНастройкиНаСервере()
	Элементы.ГП_НастройкаПараметров.Заголовок = ГП_ПостроитьЗаголовокНастройки();
КонецПроцедуры

&НаСервере
Функция ГП_ПостроитьЗаголовокНастройки()
	Описание = ГП_ПостроитьОписаниеНастройки();
	Если ЗначениеЗаполнено(Описание) Тогда
		Возврат СтрШаблон("Настройка параметров: %1", Описание);
	КонецЕсли;
	Возврат НСтр("ru = 'Настройка параметров'");
КонецФункции

&НаСервере
Функция ГП_ПостроитьОписаниеНастройки()
	
	Данные = РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.ПолучитьВсеПараметры();
	ЭлементыОписания = Новый Массив;
	
	МассивТиповДокументов = Данные.Получить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.ТипыДокументов);
	КоличествоТиповДокументов = ?(ТипЗнч(МассивТиповДокументов) = Тип("Массив"), МассивТиповДокументов.Количество(), 0);
	Если КоличествоТиповДокументов > 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЭлементыОписания, ПолучитьСклоненияСтрокиПоЧислу("тип документа", КоличествоТиповДокументов));
	КонецЕсли;
	
	МассивОрганизаций = Данные.Получить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.Организации);
	КоличествоОрганизаций = ?(ТипЗнч(МассивОрганизаций) = Тип("Массив"), МассивОрганизаций.Количество(), 0);
	Если КоличествоОрганизаций > 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЭлементыОписания, ПолучитьСклоненияСтрокиПоЧислу("организация", КоличествоОрганизаций));
	КонецЕсли;
	
	ПолучателиРассылки = Данные.Получить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.ПолучателиРассылки);
	Если ТипЗнч(ПолучателиРассылки) = Тип("Строка") И ЗначениеЗаполнено(ПолучателиРассылки) Тогда
		ЭлементыОписания.Добавить("получатели рассылки заданы");
	КонецЕсли;
	
	Возврат СтрСоединить(ЭлементыОписания, ", ");
	
КонецФункции

#КонецОбласти
